experiments/exp_15_async_2024-05-08/output.txt
brynjar@node2:~$ cd exp_15
brynjar@node2:~/exp_15$ sudo sh run.sh
liburing-test: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=liburing, iodepth=1
fio-3.35-uring2
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=13.1MiB/s][r=26.9k IOPS][eta 00m:00s]
liburing-test: (groupid=0, jobs=1): err= 0: pid=205057: Thu May  9 14:25:20 2024
  read: IOPS=26.6k, BW=13.0MiB/s (13.6MB/s)(778MiB/60001msec)
    slat (nsec): min=49, max=18275, avg=70.32, stdev=29.67
    clat (usec): min=16, max=1685, avg=37.09, stdev= 3.26
     lat (usec): min=16, max=1685, avg=37.16, stdev= 3.26
    clat percentiles (nsec):
     |  1.00th=[35072],  5.00th=[35584], 10.00th=[35584], 20.00th=[36096],
     | 30.00th=[36096], 40.00th=[36608], 50.00th=[36608], 60.00th=[37120],
     | 70.00th=[37120], 80.00th=[37632], 90.00th=[38144], 95.00th=[38656],
     | 99.00th=[51968], 99.50th=[61696], 99.90th=[69120], 99.95th=[71168],
     | 99.99th=[96768]
   bw (  KiB/s): min=12854, max=13497, per=100.00%, avg=13285.03, stdev=161.46, samples=119
   iops        : min=25708, max=26994, avg=26570.03, stdev=322.92, samples=119
  lat (usec)   : 20=0.01%, 50=98.94%, 100=1.06%, 250=0.01%, 500=0.01%
  lat (usec)   : 750=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=3.43%, sys=10.13%, ctx=1594073, majf=0, minf=1020
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1594067,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=13.0MiB/s (13.6MB/s), 13.0MiB/s-13.0MiB/s (13.6MB/s-13.6MB/s), io=778MiB (816MB), run=60001-60001msec

Disk stats (read/write):
  nvme2n1: ios=1591100/1597314, sectors=1591100/1597578, merge=0/12, ticks=14423/18631, in_queue=33054, util=100.00%
liburing-test: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=liburing, iodepth=2
fio-3.35-uring2
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=28.6MiB/s][r=58.6k IOPS][eta 00m:00s]
liburing-test: (groupid=0, jobs=1): err= 0: pid=205862: Thu May  9 14:26:20 2024
  read: IOPS=57.0k, BW=27.8MiB/s (29.2MB/s)(1670MiB/60001msec)
    slat (nsec): min=43, max=30858, avg=58.09, stdev=48.74
    clat (usec): min=11, max=173, avg=34.62, stdev= 4.05
     lat (usec): min=11, max=173, avg=34.68, stdev= 4.05
    clat percentiles (nsec):
     |  1.00th=[29568],  5.00th=[30336], 10.00th=[30592], 20.00th=[31360],
     | 30.00th=[32640], 40.00th=[33536], 50.00th=[34560], 60.00th=[35072],
     | 70.00th=[35584], 80.00th=[36608], 90.00th=[39168], 95.00th=[40704],
     | 99.00th=[49408], 99.50th=[60160], 99.90th=[69120], 99.95th=[71168],
     | 99.99th=[81408]
   bw (  KiB/s): min=24893, max=29904, per=100.00%, avg=28510.34, stdev=1495.21, samples=119
   iops        : min=49786, max=59810, avg=57020.72, stdev=2990.44, samples=119
  lat (usec)   : 20=0.01%, 50=99.02%, 100=0.97%, 250=0.01%
  cpu          : usr=5.85%, sys=20.36%, ctx=3395089, majf=0, minf=1211
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3420025,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
   READ: bw=27.8MiB/s (29.2MB/s), 27.8MiB/s-27.8MiB/s (29.2MB/s-29.2MB/s), io=1670MiB (1751MB), run=60001-60001msec

Disk stats (read/write):
  nvme2n1: ios=3414349/1713475, sectors=3414349/1713739, merge=0/12, ticks=31350/20352, in_queue=51703, util=100.00%
liburing-test: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=liburing, iodepth=4
fio-3.35-uring2
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=44.4MiB/s][r=91.0k IOPS][eta 00m:00s]
liburing-test: (groupid=0, jobs=1): err= 0: pid=206650: Thu May  9 14:27:21 2024
  read: IOPS=89.8k, BW=43.8MiB/s (46.0MB/s)(2630MiB/60001msec)
    slat (nsec): min=42, max=46987, avg=64.87, stdev=136.86
    clat (usec): min=12, max=1234, avg=44.02, stdev= 7.85
     lat (usec): min=12, max=1234, avg=44.09, stdev= 7.85
    clat percentiles (usec):
     |  1.00th=[   33],  5.00th=[   37], 10.00th=[   38], 20.00th=[   40],
     | 30.00th=[   41], 40.00th=[   43], 50.00th=[   44], 60.00th=[   45],
     | 70.00th=[   46], 80.00th=[   47], 90.00th=[   49], 95.00th=[   53],
     | 99.00th=[   82], 99.50th=[   84], 99.90th=[   93], 99.95th=[   99],
     | 99.99th=[  114]
   bw (  KiB/s): min=41866, max=50849, per=100.00%, avg=44882.85, stdev=1665.27, samples=119
   iops        : min=83732, max=101698, avg=89765.75, stdev=3330.68, samples=119
  lat (usec)   : 20=0.01%, 50=92.08%, 100=7.86%, 250=0.05%, 500=0.01%
  lat (usec)   : 750=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=8.16%, sys=28.14%, ctx=2458205, majf=0, minf=1479
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5385569,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=43.8MiB/s (46.0MB/s), 43.8MiB/s-43.8MiB/s (46.0MB/s-46.0MB/s), io=2630MiB (2757MB), run=60001-60001msec

Disk stats (read/write):
  nvme2n1: ios=5375525/1380599, sectors=5375525/1380863, merge=0/12, ticks=56787/16834, in_queue=73620, util=100.00%
liburing-test: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=liburing, iodepth=8
fio-3.35-uring2
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=82.8MiB/s][r=170k IOPS][eta 00m:00s]
liburing-test: (groupid=0, jobs=1): err= 0: pid=207462: Thu May  9 14:28:21 2024
  read: IOPS=161k, BW=78.4MiB/s (82.2MB/s)(4704MiB/60001msec)
    slat (nsec): min=40, max=56104, avg=104.36, stdev=298.29
    clat (usec): min=11, max=502, avg=49.10, stdev=10.35
     lat (usec): min=11, max=502, avg=49.20, stdev=10.37
    clat percentiles (usec):
     |  1.00th=[   22],  5.00th=[   30], 10.00th=[   35], 20.00th=[   42],
     | 30.00th=[   46], 40.00th=[   49], 50.00th=[   51], 60.00th=[   52],
     | 70.00th=[   55], 80.00th=[   57], 90.00th=[   61], 95.00th=[   64],
     | 99.00th=[   74], 99.50th=[   80], 99.90th=[   91], 99.95th=[   95],
     | 99.99th=[  109]
   bw (  KiB/s): min=73644, max=85208, per=99.98%, avg=80261.21, stdev=3104.62, samples=119
   iops        : min=147288, max=170416, avg=160522.40, stdev=6209.24, samples=119
  lat (usec)   : 20=0.42%, 50=48.22%, 100=51.34%, 250=0.02%, 500=0.01%
  lat (usec)   : 750=0.01%
  cpu          : usr=13.54%, sys=50.01%, ctx=1702487, majf=0, minf=2763
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=9633454,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=78.4MiB/s (82.2MB/s), 78.4MiB/s-78.4MiB/s (82.2MB/s-82.2MB/s), io=4704MiB (4932MB), run=60001-60001msec

Disk stats (read/write):
  nvme2n1: ios=9614835/1205944, sectors=9614835/1206208, merge=0/12, ticks=112907/14624, in_queue=127530, util=100.00%
liburing-test: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=liburing, iodepth=16
fio-3.35-uring2
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=122MiB/s][r=249k IOPS][eta 00m:00s]
liburing-test: (groupid=0, jobs=1): err= 0: pid=208271: Thu May  9 14:29:21 2024
  read: IOPS=249k, BW=122MiB/s (128MB/s)(7303MiB/60001msec)
    slat (nsec): min=41, max=97879, avg=97.80, stdev=263.81
    clat (usec): min=11, max=1090, avg=63.55, stdev=21.54
     lat (usec): min=11, max=1090, avg=63.65, stdev=21.56
    clat percentiles (usec):
     |  1.00th=[   20],  5.00th=[   28], 10.00th=[   34], 20.00th=[   42],
     | 30.00th=[   50], 40.00th=[   60], 50.00th=[   69], 60.00th=[   75],
     | 70.00th=[   79], 80.00th=[   83], 90.00th=[   88], 95.00th=[   93],
     | 99.00th=[  106], 99.50th=[  113], 99.90th=[  131], 99.95th=[  141],
     | 99.99th=[  163]
   bw (  KiB/s): min=121016, max=127142, per=100.00%, avg=124660.12, stdev=1399.73, samples=119
   iops        : min=242032, max=254284, avg=249320.30, stdev=2799.55, samples=119
  lat (usec)   : 20=1.24%, 50=29.27%, 100=67.58%, 250=1.91%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=20.01%, sys=70.89%, ctx=642910, majf=0, minf=2003
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=14955712,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=122MiB/s (128MB/s), 122MiB/s-122MiB/s (128MB/s-128MB/s), io=7303MiB (7657MB), run=60001-60001msec

Disk stats (read/write):
  nvme2n1: ios=14928024/944788, sectors=14928024/945052, merge=0/12, ticks=232744/11783, in_queue=244527, util=100.00%
liburing-test: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=liburing, iodepth=32
fio-3.35-uring2
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=129MiB/s][r=265k IOPS][eta 00m:00s]
liburing-test: (groupid=0, jobs=1): err= 0: pid=209089: Thu May  9 14:30:22 2024
  read: IOPS=265k, BW=129MiB/s (136MB/s)(7768MiB/60001msec)
    slat (nsec): min=41, max=86847, avg=86.66, stdev=236.81
    clat (usec): min=12, max=468, avg=120.11, stdev=26.63
     lat (usec): min=12, max=468, avg=120.20, stdev=26.65
    clat percentiles (usec):
     |  1.00th=[   68],  5.00th=[   75], 10.00th=[   80], 20.00th=[   96],
     | 30.00th=[  108], 40.00th=[  116], 50.00th=[  123], 60.00th=[  130],
     | 70.00th=[  137], 80.00th=[  143], 90.00th=[  151], 95.00th=[  159],
     | 99.00th=[  178], 99.50th=[  188], 99.90th=[  208], 99.95th=[  221],
     | 99.99th=[  249]
   bw (  KiB/s): min=130637, max=134132, per=100.00%, avg=132600.92, stdev=620.61, samples=119
   iops        : min=261272, max=268264, avg=265201.83, stdev=1241.25, samples=119
  lat (usec)   : 20=0.01%, 50=0.15%, 100=23.20%, 250=76.65%, 500=0.01%
  cpu          : usr=20.16%, sys=79.75%, ctx=3468, majf=0, minf=2086
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=15907871,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=129MiB/s (136MB/s), 129MiB/s-129MiB/s (136MB/s-136MB/s), io=7768MiB (8145MB), run=60001-60001msec

Disk stats (read/write):
  nvme2n1: ios=15878788/898257, sectors=15878788/898521, merge=0/12, ticks=259517/11173, in_queue=270690, util=100.00%
liburing-test: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=liburing, iodepth=64
fio-3.35-uring2
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=130MiB/s][r=267k IOPS][eta 00m:00s]
liburing-test: (groupid=0, jobs=1): err= 0: pid=209979: Thu May  9 14:31:22 2024
  read: IOPS=266k, BW=130MiB/s (136MB/s)(7788MiB/60001msec)
    slat (nsec): min=42, max=115202, avg=89.77, stdev=236.79
    clat (usec): min=15, max=1585, avg=240.15, stdev=28.19
     lat (usec): min=15, max=1585, avg=240.24, stdev=28.21
    clat percentiles (usec):
     |  1.00th=[  184],  5.00th=[  196], 10.00th=[  202], 20.00th=[  212],
     | 30.00th=[  227], 40.00th=[  235], 50.00th=[  243], 60.00th=[  249],
     | 70.00th=[  258], 80.00th=[  265], 90.00th=[  273], 95.00th=[  281],
     | 99.00th=[  306], 99.50th=[  314], 99.90th=[  347], 99.95th=[  363],
     | 99.99th=[  404]
   bw (  KiB/s): min=126909, max=134332, per=100.00%, avg=132964.30, stdev=1059.41, samples=119
   iops        : min=253818, max=268664, avg=265928.64, stdev=2118.77, samples=119
  lat (usec)   : 20=0.01%, 50=0.01%, 100=0.01%, 250=60.75%, 500=39.25%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=19.91%, sys=80.08%, ctx=136, majf=0, minf=2593
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=15950587,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=130MiB/s (136MB/s), 130MiB/s-130MiB/s (136MB/s-136MB/s), io=7788MiB (8167MB), run=60001-60001msec

Disk stats (read/write):
  nvme2n1: ios=15921410/899039, sectors=15921410/899303, merge=0/12, ticks=260421/11130, in_queue=271550, util=100.00%
liburing-test: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=liburing, iodepth=1
fio-3.35-uring2
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=12.8MiB/s][r=26.3k IOPS][eta 00m:00s]
liburing-test: (groupid=0, jobs=1): err= 0: pid=211043: Thu May  9 14:32:22 2024
  read: IOPS=26.3k, BW=12.9MiB/s (13.5MB/s)(772MiB/60001msec)
    slat (nsec): min=45, max=6689, avg=55.24, stdev=14.11
    clat (usec): min=15, max=237, avg=37.44, stdev= 2.98
     lat (usec): min=15, max=237, avg=37.50, stdev= 2.98
    clat percentiles (nsec):
     |  1.00th=[35072],  5.00th=[35584], 10.00th=[35584], 20.00th=[36096],
     | 30.00th=[36608], 40.00th=[36608], 50.00th=[37120], 60.00th=[37120],
     | 70.00th=[37632], 80.00th=[38144], 90.00th=[38656], 95.00th=[39168],
     | 99.00th=[52480], 99.50th=[62720], 99.90th=[69120], 99.95th=[71168],
     | 99.99th=[87552]
   bw (  KiB/s): min=12600, max=13341, per=100.00%, avg=13173.61, stdev=204.96, samples=119
   iops        : min=25200, max=26682, avg=26347.21, stdev=409.92, samples=119
  lat (usec)   : 20=0.01%, 50=98.91%, 100=1.08%, 250=0.01%
  cpu          : usr=3.04%, sys=9.98%, ctx=1580571, majf=0, minf=595
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1580569,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=12.9MiB/s (13.5MB/s), 12.9MiB/s-12.9MiB/s (13.5MB/s-13.5MB/s), io=772MiB (809MB), run=60001-60001msec

Disk stats (read/write):
  nvme2n1: ios=1577662/1583557, sectors=1577662/1583821, merge=0/12, ticks=14107/18637, in_queue=32744, util=100.00%
liburing-test: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=liburing, iodepth=2
fio-3.35-uring2
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=24.9MiB/s][r=50.9k IOPS][eta 00m:00s]
liburing-test: (groupid=0, jobs=1): err= 0: pid=211845: Thu May  9 14:33:23 2024
  read: IOPS=50.2k, BW=24.5MiB/s (25.7MB/s)(1471MiB/60001msec)
    slat (nsec): min=44, max=35403, avg=69.52, stdev=41.78
    clat (usec): min=11, max=1886, avg=39.34, stdev= 4.11
     lat (usec): min=11, max=1886, avg=39.41, stdev= 4.11
    clat percentiles (usec):
     |  1.00th=[   35],  5.00th=[   36], 10.00th=[   37], 20.00th=[   37],
     | 30.00th=[   38], 40.00th=[   39], 50.00th=[   40], 60.00th=[   41],
     | 70.00th=[   41], 80.00th=[   42], 90.00th=[   43], 95.00th=[   44],
     | 99.00th=[   56], 99.50th=[   66], 99.90th=[   74], 99.95th=[   80],
     | 99.99th=[  110]
   bw (  KiB/s): min=23247, max=25544, per=100.00%, avg=25105.26, stdev=532.44, samples=119
   iops        : min=46494, max=51088, avg=50210.52, stdev=1064.89, samples=119
  lat (usec)   : 20=0.01%, 50=98.72%, 100=1.25%, 250=0.02%, 500=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=5.39%, sys=18.21%, ctx=3010082, majf=0, minf=1383
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3012417,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
   READ: bw=24.5MiB/s (25.7MB/s), 24.5MiB/s-24.5MiB/s (25.7MB/s-25.7MB/s), io=1471MiB (1542MB), run=60001-60001msec

Disk stats (read/write):
  nvme2n1: ios=3006852/1509332, sectors=3006852/1509596, merge=0/12, ticks=28960/18166, in_queue=47126, util=100.00%
liburing-test: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=liburing, iodepth=4
fio-3.35-uring2
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=44.1MiB/s][r=90.3k IOPS][eta 00m:00s]
liburing-test: (groupid=0, jobs=1): err= 0: pid=212636: Thu May  9 14:34:23 2024
  read: IOPS=90.9k, BW=44.4MiB/s (46.5MB/s)(2662MiB/60001msec)
    slat (nsec): min=43, max=16855, avg=62.68, stdev=131.40
    clat (usec): min=10, max=188, avg=43.55, stdev= 7.34
     lat (usec): min=10, max=188, avg=43.61, stdev= 7.34
    clat percentiles (usec):
     |  1.00th=[   33],  5.00th=[   37], 10.00th=[   38], 20.00th=[   39],
     | 30.00th=[   41], 40.00th=[   42], 50.00th=[   43], 60.00th=[   44],
     | 70.00th=[   45], 80.00th=[   47], 90.00th=[   49], 95.00th=[   51],
     | 99.00th=[   81], 99.50th=[   82], 99.90th=[   90], 99.95th=[   97],
     | 99.99th=[  112]
   bw (  KiB/s): min=43137, max=46475, per=100.00%, avg=45440.80, stdev=489.68, samples=119
   iops        : min=86274, max=92950, avg=90881.63, stdev=979.29, samples=119
  lat (usec)   : 20=0.01%, 50=94.15%, 100=5.80%, 250=0.04%
  cpu          : usr=7.49%, sys=30.22%, ctx=2171004, majf=0, minf=1477
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5451540,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=44.4MiB/s (46.5MB/s), 44.4MiB/s-44.4MiB/s (46.5MB/s-46.5MB/s), io=2662MiB (2791MB), run=60001-60001msec

Disk stats (read/write):
  nvme2n1: ios=5441549/1394700, sectors=5441550/1394964, merge=0/12, ticks=57234/16503, in_queue=73737, util=100.00%
liburing-test: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=liburing, iodepth=8
fio-3.35-uring2
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=73.8MiB/s][r=151k IOPS][eta 00m:00s]
liburing-test: (groupid=0, jobs=1): err= 0: pid=213418: Thu May  9 14:35:23 2024
  read: IOPS=159k, BW=77.6MiB/s (81.3MB/s)(4653MiB/60001msec)
    slat (nsec): min=43, max=53540, avg=101.07, stdev=268.03
    clat (usec): min=11, max=2024, avg=49.75, stdev=10.15
     lat (usec): min=11, max=2024, avg=49.85, stdev=10.16
    clat percentiles (usec):
     |  1.00th=[   22],  5.00th=[   31], 10.00th=[   37], 20.00th=[   44],
     | 30.00th=[   47], 40.00th=[   49], 50.00th=[   51], 60.00th=[   52],
     | 70.00th=[   55], 80.00th=[   57], 90.00th=[   61], 95.00th=[   65],
     | 99.00th=[   75], 99.50th=[   81], 99.90th=[   92], 99.95th=[   97],
     | 99.99th=[  113]
   bw (  KiB/s): min=73172, max=86153, per=100.00%, avg=79465.01, stdev=3008.44, samples=119
   iops        : min=146344, max=172306, avg=158929.98, stdev=6016.89, samples=119
  lat (usec)   : 20=0.23%, 50=46.73%, 100=53.00%, 250=0.03%, 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=12.41%, sys=52.32%, ctx=1792381, majf=0, minf=2949
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=9529803,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=77.6MiB/s (81.3MB/s), 77.6MiB/s-77.6MiB/s (81.3MB/s-81.3MB/s), io=4653MiB (4879MB), run=60001-60001msec

Disk stats (read/write):
  nvme2n1: ios=9513041/1194297, sectors=9513041/1194561, merge=0/12, ticks=112921/14706, in_queue=127627, util=100.00%
liburing-test: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=liburing, iodepth=16
fio-3.35-uring2
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=110MiB/s][r=225k IOPS][eta 00m:00s]
liburing-test: (groupid=0, jobs=1): err= 0: pid=214213: Thu May  9 14:36:24 2024
  read: IOPS=218k, BW=106MiB/s (112MB/s)(6382MiB/60001msec)
    slat (nsec): min=41, max=72834, avg=102.10, stdev=359.68
    clat (usec): min=10, max=904, avg=72.69, stdev=24.04
     lat (usec): min=10, max=904, avg=72.80, stdev=24.07
    clat percentiles (usec):
     |  1.00th=[   24],  5.00th=[   35], 10.00th=[   41], 20.00th=[   48],
     | 30.00th=[   57], 40.00th=[   68], 50.00th=[   76], 60.00th=[   82],
     | 70.00th=[   88], 80.00th=[   95], 90.00th=[  104], 95.00th=[  110],
     | 99.00th=[  121], 99.50th=[  124], 99.90th=[  135], 99.95th=[  143],
     | 99.99th=[  161]
   bw (  KiB/s): min=101933, max=122268, per=100.00%, avg=108918.17, stdev=4631.34, samples=119
   iops        : min=203866, max=244536, avg=217836.30, stdev=9262.70, samples=119
  lat (usec)   : 20=0.43%, 50=22.63%, 100=62.75%, 250=14.19%, 500=0.01%
  lat (usec)   : 1000=0.01%
  cpu          : usr=18.81%, sys=80.21%, ctx=53229, majf=0, minf=2628
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=13070375,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=106MiB/s (112MB/s), 106MiB/s-106MiB/s (112MB/s-112MB/s), io=6382MiB (6692MB), run=60001-60001msec

Disk stats (read/write):
  nvme2n1: ios=13046343/1080761, sectors=13046343/1081025, merge=0/12, ticks=176685/13427, in_queue=190113, util=100.00%
liburing-test: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=liburing, iodepth=32
fio-3.35-uring2
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=108MiB/s][r=221k IOPS][eta 00m:00s]
liburing-test: (groupid=0, jobs=1): err= 0: pid=215023: Thu May  9 14:37:24 2024
  read: IOPS=218k, BW=107MiB/s (112MB/s)(6392MiB/60001msec)
    slat (nsec): min=42, max=68747, avg=108.89, stdev=394.76
    clat (usec): min=11, max=1206, avg=145.92, stdev=27.18
     lat (usec): min=11, max=1206, avg=146.03, stdev=27.22
    clat percentiles (usec):
     |  1.00th=[   84],  5.00th=[   98], 10.00th=[  106], 20.00th=[  124],
     | 30.00th=[  135], 40.00th=[  141], 50.00th=[  147], 60.00th=[  155],
     | 70.00th=[  161], 80.00th=[  169], 90.00th=[  180], 95.00th=[  188],
     | 99.00th=[  202], 99.50th=[  206], 99.90th=[  217], 99.95th=[  221],
     | 99.99th=[  241]
   bw (  KiB/s): min=103630, max=115493, per=99.99%, avg=109073.32, stdev=2360.84, samples=119
   iops        : min=207260, max=230986, avg=218146.61, stdev=4721.62, samples=119
  lat (usec)   : 20=0.01%, 50=0.01%, 100=6.14%, 250=93.85%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=18.52%, sys=81.45%, ctx=1627, majf=0, minf=2803
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=13089999,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=107MiB/s (112MB/s), 107MiB/s-107MiB/s (112MB/s-112MB/s), io=6392MiB (6702MB), run=60001-60001msec

Disk stats (read/write):
  nvme2n1: ios=13064429/1112393, sectors=13064429/1112657, merge=0/12, ticks=176494/13570, in_queue=190063, util=100.00%
liburing-test: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=liburing, iodepth=64
fio-3.35-uring2
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=107MiB/s][r=218k IOPS][eta 00m:00s]
liburing-test: (groupid=0, jobs=1): err= 0: pid=215895: Thu May  9 14:38:24 2024
  read: IOPS=215k, BW=105MiB/s (110MB/s)(6296MiB/60001msec)
    slat (nsec): min=42, max=74484, avg=109.73, stdev=395.31
    clat (usec): min=21, max=737, avg=297.03, stdev=38.22
     lat (usec): min=21, max=738, avg=297.14, stdev=38.26
    clat percentiles (usec):
     |  1.00th=[  212],  5.00th=[  227], 10.00th=[  241], 20.00th=[  265],
     | 30.00th=[  277], 40.00th=[  289], 50.00th=[  297], 60.00th=[  310],
     | 70.00th=[  322], 80.00th=[  334], 90.00th=[  347], 95.00th=[  355],
     | 99.00th=[  367], 99.50th=[  375], 99.90th=[  392], 99.95th=[  404],
     | 99.99th=[  465]
   bw (  KiB/s): min=102654, max=116129, per=100.00%, avg=107445.15, stdev=2517.51, samples=119
   iops        : min=205308, max=232258, avg=214890.39, stdev=5035.03, samples=119
  lat (usec)   : 50=0.01%, 100=0.01%, 250=12.76%, 500=87.23%, 750=0.01%
  cpu          : usr=18.31%, sys=81.68%, ctx=627, majf=0, minf=1085
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=12893731,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=105MiB/s (110MB/s), 105MiB/s-105MiB/s (110MB/s-110MB/s), io=6296MiB (6602MB), run=60001-60001msec

Disk stats (read/write):
  nvme2n1: ios=12870448/1115472, sectors=12870448/1115736, merge=0/12, ticks=172139/13605, in_queue=185745, util=100.00%